# Imports

In [1]:
# Imports 
import pandas as pd
import numpy as np

# Data Dictionary

**IMDb Datasets**

Subsets of IMDb data are available for access to customers for personal and non-commercial use. You can hold local copies of this data, and it is subject to our terms and conditions. Please refer to the Non-Commercial Licensing and copyright/license and verify compliance.

**Data Location**

The dataset files can be accessed and downloaded from https://datasets.imdbws.com/. The data is refreshed daily.

**IMDb Dataset Details**

Each dataset is contained in a gzipped, tab-separated-values (TSV) formatted file in the UTF-8 character set. The first line in each file contains headers that describe what is in each column. A ‘\N’ is used to denote that a particular field is missing or null for that title/name. The available datasets are as follows:

**title.akas.tsv.gz** - Contains the following information for titles:

- titleId (string) - a tconst, an alphanumeric unique identifier of the title

- ordering (integer) – a number to uniquely identify rows for a given titleId

- title (string) – the localized title

- region (string) - the region for this version of the title

- language (string) - the language of the title

- types (array) - Enumerated set of attributes for this alternative title. One or more of the following: "alternative", "dvd", "festival", "tv", "video", "working", "original", "imdbDisplay". New values may be added in the future without warning

- attributes (array) - Additional terms to describe this alternative title, not enumerated

- isOriginalTitle (boolean) – 0: not original title; 1: original title

**title.basics.tsv.gz** - Contains the following information for titles:

- tconst (string) - alphanumeric unique identifier of the title

- titleType (string) – the type/format of the title (e.g. movie, short, tvseries, tvepisode, video, etc)

- primaryTitle (string) – the more popular title / the title used by the filmmakers on promotional materials at the point of release

- originalTitle (string) - original title, in the original language

- isAdult (boolean) - 0: non-adult title; 1: adult title

- startYear (YYYY) – represents the release year of a title. In the case of TV Series, it is the series start year

- endYear (YYYY) – TV Series end year. ‘\N’ for all other title types

- runtimeMinutes – primary runtime of the title, in minutes

- genres (string array) – includes up to three genres associated with the title

**title.ratings.tsv.gz** – Contains the IMDb rating and votes information for titles
- tconst (string) - alphanumeric unique identifier of the title
- averageRating – weighted average of all the individual user ratings
- numVotes - number of votes the title has received

# Loading the Data

In [31]:
# URLs for each dataframe needed
#basics_url = 'https://datasets.imdbws.com/title.basics.tsv.gz'
#akas_url = 'https://datasets.imdbws.com/title.akas.tsv.gz'
#ratings_url = 'https://datasets.imdbws.com/title.ratings.tsv.gz'
# Loading the data for basics
# basics = pd.read_csv(basics_url, sep='\t', low_memory=False)
# Open saved file and preview again
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [38]:
# Loading the Data for akas
# akas = pd.read_csv(akas_url, sep='\t', low_memory=True)
# Open saved file and preview again
akas = pd.read_csv("Data/title_akas.csv.gz", low_memory = False)
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0.0
1,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0.0
2,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0.0
3,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0.0
4,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0.0

In [35]:
# Loading the data for ratings
# ratings = pd.read_csv(ratings_url, sep='\t', low_memory=True)
# Open saved file and preview again
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1965
1  tt0000002            5.8       263
2  tt0000003            6.5      1808
3  tt0000004            5.6       178
4  tt0000005            6.2      2607

# Data Cleaning

## Cleaning the Basics Dataset

In [5]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9803682 entries, 0 to 9803681
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 673.2+ MB

In [6]:
basics.duplicated().sum()

0

In [7]:
# Replacing the '\N' with np.nan
basics.replace({'\\N':np.nan}, inplace=True)

In [8]:
basics.isna().sum()

tconst                  0
titleType               0
primaryTitle           11
originalTitle          11
isAdult                 1
startYear         1327596
endYear           9697873
runtimeMinutes    6916931
genres             442051
dtype: int64

In [9]:
# Dropping movies with missing data from 'runtimeMinutes'
basics.dropna(subset = ['runtimeMinutes'], inplace=True)
# Checking if the change took place
basics.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 1
startYear          169567
endYear           2835564
runtimeMinutes          0
genres              76575
dtype: int64

In [10]:
# Dropping the movies that are missing values from 'genres'
basics.dropna(subset = ['genres'], inplace=True)
# Checking to see if the change took place
basics.isna().sum()

tconst                  0
titleType               0
primaryTitle            1
originalTitle           1
isAdult                 0
startYear          164621
endYear           2760577
runtimeMinutes          0
genres                  0
dtype: int64

In [11]:
basics['titleType'].value_counts()

tvEpisode       1423525
short            599187
movie            381413
video            180132
tvMovie           91416
tvSeries          90231
tvSpecial         18045
tvMiniSeries      17115
tvShort            8790
videoGame           322
Name: titleType, dtype: int64

In [12]:
# Keeping only the type 'movie'
basics.query("titleType == 'movie'", inplace=True)
# Checking if the change took place
basics['titleType'].value_counts()

movie    381413
Name: titleType, dtype: int64

In [13]:
basics['startYear'].value_counts()

2017    14366
2018    14321
2019    14053
2016    13945
2015    13474
        ...
1904        1
1897        1
1896        1
2026        1
1894        1
Name: startYear, Length: 130, dtype: int64

In [14]:
# Dropping nan values for 'startYear'
basics.dropna(subset = ['startYear'], inplace=True)
basics.isna().sum()

tconst                 0
titleType              0
primaryTitle           0
originalTitle          0
isAdult                0
startYear              0
endYear           374997
runtimeMinutes         0
genres                 0
dtype: int64

In [15]:
# Changing the type to 'int' in order to process it
basics['startYear'] = basics['startYear'].astype('int')
# Checking to see if the change took place
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 374997 entries, 8 to 9803632
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          374997 non-null  object
 1   titleType       374997 non-null  object
 2   primaryTitle    374997 non-null  object
 3   originalTitle   374997 non-null  object
 4   isAdult         374997 non-null  object
 5   startYear       374997 non-null  int32
 6   endYear         0 non-null       object
 7   runtimeMinutes  374997 non-null  object
 8   genres          374997 non-null  object
dtypes: int32(1), object(8)
memory usage: 27.2+ MB

In [19]:
basics = basics[(basics['startYear'] >= 2000) & (basics['startYear'] < 2023)]
basics['startYear'].value_counts()

2017    14366
2018    14321
2019    14053
2016    13945
2015    13474
2014    13100
2022    12722
2013    12379
2021    12322
2012    11625
2020    11560
2011    10773
2010    10199
2009     9350
2008     8148
2007     6962
2006     6512
2005     5828
2004     5201
2003     4587
2002     4131
2001     3861
2000     3638
Name: startYear, dtype: int64

In [20]:
# Exclude movies that are included in the documentary category.
is_documentary = basics['genres'].str.contains('documentary',case=False)
basics = basics[~is_documentary]

In [21]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers =basics['tconst'].isin(akas['titleId'])
keepers

34803      True
61116      True
67669      True
77964      True
86801      True
           ...
9803355    True
9803364    True
9803403    True
9803448    True
9803532    True
Name: tconst, Length: 147331, dtype: bool

In [22]:
basics = basics[keepers]
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61116,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
67669,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
77964,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
86801,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
9803355,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
9803364,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
9803403,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller
9803448,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
9803532,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama

## Cleaning the Ratings Dataset

In [17]:
# Replacing the '\N' with np.nan
ratings.replace({'\\N':np.nan}, inplace=True)

In [25]:
# Filter the basics table down to only include the US by using the filter akas dataframe
keepers2 =ratings['tconst'].isin(akas['titleId'])
keepers2

0           True
1           True
2           True
3           True
4           True
           ...
1305608     True
1305609     True
1305610    False
1305611    False
1305612    False
Name: tconst, Length: 1305613, dtype: bool

In [26]:
ratings = ratings[keepers2]
ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      1965
1        tt0000002            5.8       263
2        tt0000003            6.5      1808
3        tt0000004            5.6       178
4        tt0000005            6.2      2607
...            ...            ...       ...
1305590  tt9916460            9.4        18
1305594  tt9916538            8.6         7
1305595  tt9916544            6.9        62
1305608  tt9916730            8.3        10
1305609  tt9916766            7.0        21

[976844 rows x 3 columns]

## Cleaning the Akas Dataset

In [18]:
# Replacing the '\N' with np.nan
akas.replace({'\\N':np.nan}, inplace=True)

In [27]:
# Checking the values of 'region'
akas['region'].value_counts()

DE    4276269
FR    4271967
JP    4270834
IN    4211631
ES    4192301
       ...
JE          2
NU          1
TV          1
PW          1
NR          1
Name: region, Length: 247, dtype: int64

In [28]:
# Limiting to just movies in the US
akas = akas[(akas['region'] == 'US')]
akas['region'].value_counts()

US    1432419
Name: region, dtype: int64

# Saving New Datasets

In [29]:
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34803,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61116,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
67669,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
77964,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
86801,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
...,...,...,...,...,...,...,...,...,...
9803355,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama
9803364,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller"
9803403,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller
9803448,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History"
9803532,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama

In [30]:
## Save current dataframe to file.
basics.to_csv("Data/title_basics.csv.gz",compression='gzip',index=False)

In [32]:
ratings

            tconst  averageRating  numVotes
0        tt0000001            5.7      1965
1        tt0000002            5.8       263
2        tt0000003            6.5      1808
3        tt0000004            5.6       178
4        tt0000005            6.2      2607
...            ...            ...       ...
1305590  tt9916460            9.4        18
1305594  tt9916538            8.6         7
1305595  tt9916544            6.9        62
1305608  tt9916730            8.3        10
1305609  tt9916766            7.0        21

[976844 rows x 3 columns]

In [33]:
## Save current dataframe to file.
ratings.to_csv("Data/title_ratings.csv.gz",compression='gzip',index=False)

In [36]:
akas

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0
...,...,...,...,...,...,...,...,...
35713753,tt9916560,1,March of Dimes Presents: Once Upon a Dime,US,NaN,imdbDisplay,NaN,0
35713823,tt9916620,1,The Copeland Case,US,NaN,imdbDisplay,NaN,0
35713912,tt9916702,1,Loving London: The Playground,US,NaN,NaN,NaN,0
35713955,tt9916756,1,Pretty Pretty Black Girl,US,NaN,imdbDisplay,NaN,0
35713971,tt9916764,1,38,US,NaN,imdbDisplay,NaN,0

In [37]:
## Save current dataframe to file.
akas.to_csv("Data/title_akas.csv.gz",compression='gzip',index=False)